In [48]:
import pandas as pd
import numpy as np
from numpy.random import randn
import random
import string

## * Series is just single column of data

In [49]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [50]:
alphalist = list(string.ascii_uppercase) 
print(alphalist)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [51]:
index1 = [alphalist[i] for i in range(10)]
index1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [52]:
serie1 = pd.Series(data=data1, index =index1)
serie1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [53]:
dico = {k:v for k,v in zip(index1, data1)}

In [54]:
serie2 = pd.Series(dico)
serie2

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [55]:
df = pd. DataFrame(np.random.randn(5,5),index='A/B/C/D/E'.split('/'),columns='V/W/X/Y/Z'.split("/"))
df

          V         W         X         Y         Z
A  0.371695  0.002657 -0.552025  0.149300 -1.185246
B  1.303649 -2.227310  0.110510  0.623443  0.033628
C -1.055505 -0.509395 -1.955441  0.398752 -1.575644
D  0.681370 -1.119191 -0.970821  0.587449  0.443261
E  1.696422  0.533214  0.895963 -0.306065 -0.520742

In [56]:
df[['V','X']]

          V         X
A  0.371695 -0.552025
B  1.303649  0.110510
C -1.055505 -1.955441
D  0.681370 -0.970821
E  1.696422  0.895963

In [57]:
# Selecting Columns 
df[['W','Y']]

          W         Y
A  0.002657  0.149300
B -2.227310  0.623443
C -0.509395  0.398752
D -1.119191  0.587449
E  0.533214 -0.306065

In [58]:
# We use iloc to select a particular row 
df.iloc[0]

V    0.371695
W    0.002657
X   -0.552025
Y    0.149300
Z   -1.185246
Name: A, dtype: float64

In [59]:
df.loc['B']['V']

1.3036488298525368

In [60]:
df['W']> 0

A     True
B    False
C    False
D    False
E     True
Name: W, dtype: bool

In [61]:
df['U'] =df['V']+df['Z'] #adding new column to the data frame

In [62]:
df

          V         W         X         Y         Z         U
A  0.371695  0.002657 -0.552025  0.149300 -1.185246 -0.813550
B  1.303649 -2.227310  0.110510  0.623443  0.033628  1.337277
C -1.055505 -0.509395 -1.955441  0.398752 -1.575644 -2.631148
D  0.681370 -1.119191 -0.970821  0.587449  0.443261  1.124631
E  1.696422  0.533214  0.895963 -0.306065 -0.520742  1.175681

In [63]:
df[df['U'] > df['V']]

          V         W         X         Y         Z         U
B  1.303649 -2.227310  0.110510  0.623443  0.033628  1.337277
D  0.681370 -1.119191 -0.970821  0.587449  0.443261  1.124631

In [64]:
df.iloc[0]

V    0.371695
W    0.002657
X   -0.552025
Y    0.149300
Z   -1.185246
U   -0.813550
Name: A, dtype: float64

In [65]:
df.loc['A']

V    0.371695
W    0.002657
X   -0.552025
Y    0.149300
Z   -1.185246
U   -0.813550
Name: A, dtype: float64

In [66]:
df[['W']]

          W
A  0.002657
B -2.227310
C -0.509395
D -1.119191
E  0.533214

In [67]:
df[['W','Y']]

          W         Y
A  0.002657  0.149300
B -2.227310  0.623443
C -0.509395  0.398752
D -1.119191  0.587449
E  0.533214 -0.306065

In [68]:
df.loc['B']['X']

0.11050988913412402

In [69]:
df.iloc[1]['X']

0.11050988913412402

In [70]:
df.iloc[3]['Z']

0.4432608944905805

In [71]:
df.iloc[3]['X']

-0.9708205554966592

In [72]:
df

          V         W         X         Y         Z         U
A  0.371695  0.002657 -0.552025  0.149300 -1.185246 -0.813550
B  1.303649 -2.227310  0.110510  0.623443  0.033628  1.337277
C -1.055505 -0.509395 -1.955441  0.398752 -1.575644 -2.631148
D  0.681370 -1.119191 -0.970821  0.587449  0.443261  1.124631
E  1.696422  0.533214  0.895963 -0.306065 -0.520742  1.175681

In [73]:
df.iloc[3][['X','Z']]

X   -0.970821
Z    0.443261
Name: D, dtype: float64

In [74]:
df[['X','Z']].loc['D']

X   -0.970821
Z    0.443261
Name: D, dtype: float64

In [75]:
df[['X','Z']].iloc[3]

X   -0.970821
Z    0.443261
Name: D, dtype: float64

In [76]:
## to grab row use iloc or loc

In [77]:
df.head() # this will return the

          V         W         X         Y         Z         U
A  0.371695  0.002657 -0.552025  0.149300 -1.185246 -0.813550
B  1.303649 -2.227310  0.110510  0.623443  0.033628  1.337277
C -1.055505 -0.509395 -1.955441  0.398752 -1.575644 -2.631148
D  0.681370 -1.119191 -0.970821  0.587449  0.443261  1.124631
E  1.696422  0.533214  0.895963 -0.306065 -0.520742  1.175681

In [78]:
df.tail() # this will reutnr the last five rows of your data frame

          V         W         X         Y         Z         U
A  0.371695  0.002657 -0.552025  0.149300 -1.185246 -0.813550
B  1.303649 -2.227310  0.110510  0.623443  0.033628  1.337277
C -1.055505 -0.509395 -1.955441  0.398752 -1.575644 -2.631148
D  0.681370 -1.119191 -0.970821  0.587449  0.443261  1.124631
E  1.696422  0.533214  0.895963 -0.306065 -0.520742  1.175681

In [79]:
df.tail(2)

          V         W         X         Y         Z         U
D  0.681370 -1.119191 -0.970821  0.587449  0.443261  1.124631
E  1.696422  0.533214  0.895963 -0.306065 -0.520742  1.175681

* # Concatinate

In [80]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3'],
                    'C':['C0', 'C1', 'C2', 'C3']},index =[0,1,2,3])
import pandas as pd

In [81]:
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                    'B':['B4', 'B5', 'B6', 'B7'],
                    'C':['C4', 'C5', 'C6', 'C7']},index =[0,1,2,3])

In [82]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [83]:
pd.concat([df1,df2], axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

# : Merging and joining data frame

## * Merging

In [95]:
left = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                    'A':['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3']}) 
                    
right = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                    'C':['C0', 'C1', 'C2', 'C3'],
                    'D':['D0', 'D1', 'D2', 'D3']})

In [96]:
pd.merge(left,right,how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [104]:
left = pd.DataFrame({'A':['A0', 'A1', 'A2'],
                    'B':['B0', 'B1', 'B2']},
                     index= ['K0', 'K1', 'K2'])
                    
                    
right = pd.DataFrame({'C':['C0', 'C2', 'C3'],
                    'D':['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [102]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [99]:
display(left,right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [100]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2